ERP.belugaerp/src/DataProcessors/бг_ЗагрузкаЛимитовИОтсрочекПокупателям/бг_ЗагрузкаЛимитовИОтсрочекПокупателям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_ЗагрузкаЛимитовИОтсрочекПокупателям</name>
  <attributes>
    <name>ТаблицаЛимитовДляЗагрузки</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаОтсрочекДляЗагрузки</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеДляЗагрузки</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентНайденный</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>DefinedType.ИНН</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТТКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТТSY</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>DefinedType.ИНН</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТТКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТТSY</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP.belugaerp/src/InformationRegisters/бг_КредитныеЛимиты/бг_КредитныеЛимиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_КредитныеЛимиты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидЛимита</name>
    <type>
      <types>EnumRef.бг_ВидыКредитныхЛимитов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ОтсрочкиПлатежаПокупателям/бг_ОтсрочкиПлатежаПокупателям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ОтсрочкиПлатежаПокупателям</name>
  <resources>
    <name>Количество</name>
    <comment>В днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипОтсрочки</name>
    <type>
      <types>EnumRef.бг_ВидыОтсрочкиПлатежаПокупателям</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/DataProcessors/бг_ЗагрузкаЛимитовИОтсрочекПокупателям/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру с параметрами для работы с процедурой ЗаполнитьРегистрыСведенийПоЛимитамИОтсрочкам 
// 
//
Функция ПараметрыЗаписиВРегистрыСведений() Экспорт

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Источник");
	ПараметрыЗаписи.Вставить("ВидЛимитаОтсрочки");
	ПараметрыЗаписи.Вставить("ТаблицаДанныхДляЗаписи");
	ПараметрыЗаписи.Вставить("ГрузитьПоПунктуНазначения");
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

// Возвращает структур для хранения результата загрузки
// 
//
Функция РезультатЗагрузки() Экспорт

	РезультатЗагрузки = Новый  Структура;
	РезультатЗагрузки.Вставить("ЕстьОшибки", Ложь);
	РезультатЗагрузки.Вставить("СтрокиСОшибкамиЗагрузки", Новый Массив);
	РезультатЗагрузки.Вставить("ТекстСообщенияПользователю", "");
	
	Возврат РезультатЗагрузки;
	
КонецФункции

// В зависимости от переданных праметром осуществляет запись в соответствующий регистр сведений.
//
//
Процедура ДобавитьЗаписиВРегистрыЛимитовИОтсрочек(ПараметрыЗаписи, ТаблицаДанныхДляЗаписи, РезультатЗагрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Источник = "РегистрСведений.бг_КредитныеЛимиты.Форма.ФормаСписка" Тогда
		ДобавитьЗаписиКредитныхЛимитов(ПараметрыЗаписи, 
										ТаблицаДанныхДляЗаписи, 
										РезультатЗагрузки);	
	ИначеЕсли ПараметрыЗаписи.Источник = "РегистрСведений.бг_ОтсрочкиПлатежаПокупателям.Форма.ФормаСписка" Тогда
		ДобавитьЗаписиОтсрочекПлатежаПокупателям(ПараметрыЗаписи, 
													ТаблицаДанныхДляЗаписи, 
													РезультатЗагрузки);			
	Иначе		
		РезультатЗагрузки.ЕстьОшибки = Истина;
		РезультатЗагрузки.ТекстСообщенияПользователю = Нстр("ru = 'Вызов команды не из 
															| формы списка соответствующих регистров, 
															| не поддерживается.'");
	КонецЕсли;
		
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаписиКредитныхЛимитов(ПараметрыЗаписи, ТаблицаДанныхДляЗаписи, РезультатЗагрузки)
	
	СтрокиСОшибками = Новый Массив;
	
	ТаблицаДляДобавленияЗаписей = Новый ТаблицаЗначений;
	ТаблицаДляДобавленияЗаписей = ТаблицаДанныхДляЗаписи.Скопировать();
	КолонкиДляГруппировкиПоКонтрагенту = "Контрагент, КонтрагентНайденный, ИНН";
	КолонкиДляСуммированияПоКонтрагенту = "Сумма, КоличествоДней";

	Если Не ПараметрыЗаписи.ГрузитьПоПунктуНазначения Тогда
		ТаблицаДляДобавленияЗаписей.Свернуть(КолонкиДляГруппировкиПоКонтрагенту, 
												КолонкиДляСуммированияПоКонтрагенту);
	КонецЕсли;
	
  	Для Каждого Строка из ТаблицаДляДобавленияЗаписей Цикл
		МенеджерЗаписи = РегистрыСведений.бг_КредитныеЛимиты.СоздатьМенеджерЗаписи();			
		МенеджерЗаписи.ВидЛимита = ПараметрыЗаписи.ВидЛимитаОтсрочки;
		МенеджерЗаписи.Контрагент = Строка.КонтрагентНайденный;
		Если ПараметрыЗаписи.ГрузитьПоПунктуНазначения Тогда
			МенеджерЗаписи.ПунктНазначения = Строка.ПунктНазначения;
		КонецЕсли;
		МенеджерЗаписи.Сумма = Строка.Сумма;
		Попытка
			МенеджерЗаписи.Записать();	
		Исключение	
			Если Не ПараметрыЗаписи.ГрузитьПоПунктуНазначения Тогда
				Отбор = Новый Структура(КолонкиДляГруппировкиПоКонтрагенту);
				ЗаполнитьЗначенияСвойств(Отбор, Строка);
				НайденныеСтрокиСОшибками = ТаблицаДанныхДляЗаписи.НайтиСтроки(Отбор);
			
				Для Каждого Строка Из НайденныеСтрокиСОшибками Цикл
					СтрокаСОшибкой = Новый Структура();
					ЗаполнитьЗначенияСвойств(СтрокаСОшибкой, Строка);										
					СтрокиСОшибками.Добавить(СтрокаСОшибкой);
	            КонецЦикла;
			Иначе
				СтрокаСОшибкой = Новый Структура();
				СтрокаСОшибкой.Вставить("Контрагент");
				СтрокаСОшибкой.Вставить("ИНН");
				СтрокаСОшибкой.Вставить("ТТКПП");
				СтрокаСОшибкой.Вставить("КодТТSY");
				СтрокаСОшибкой.Вставить("Сумма");
				
				ЗаполнитьЗначенияСвойств(СтрокаСОшибкой, Строка);
				СтрокиСОшибками.Добавить(СтрокаСОшибкой);
			КонецЕсли;				
			
			РезультатЗагрузки.ЕстьОшибки = Истина;
			
		КонецПопытки;
	КонецЦикла;	
		
	Если РезультатЗагрузки.ЕстьОшибки Тогда
		РезультатЗагрузки.СтрокиСОшибкамиЗагрузки = СтрокиСОшибками;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьЗаписиОтсрочекПлатежаПокупателям(ПараметрыЗаписи, ТаблицаДанныхДляЗаписи, РезультатЗагрузки)
	
	СтрокиСОшибками = Новый Массив;
	
	ТаблицаДляДобавленияЗаписей = Новый ТаблицаЗначений;
	ТаблицаДляДобавленияЗаписей = ТаблицаДанныхДляЗаписи.Скопировать();
	КолонкиДляГруппировкиПоКонтрагенту = "Контрагент, КонтрагентНайденный, ИНН";
	КолонкиДляСуммированияПоКонтрагенту = "Сумма, КоличествоДней";

	Если Не ПараметрыЗаписи.ГрузитьПоПунктуНазначения Тогда
		ТаблицаДляДобавленияЗаписей.Свернуть(КолонкиДляГруппировкиПоКонтрагенту, 
												КолонкиДляСуммированияПоКонтрагенту);
	КонецЕсли;	
	
  	Для Каждого Строка из ТаблицаДляДобавленияЗаписей Цикл
		МенеджерЗаписи = РегистрыСведений.бг_ОтсрочкиПлатежаПокупателям.СоздатьМенеджерЗаписи();			
		МенеджерЗаписи.ТипОтсрочки = ПараметрыЗаписи.ВидЛимитаОтсрочки;
		МенеджерЗаписи.Контрагент = Строка.КонтрагентНайденный;
		Если ПараметрыЗаписи.ГрузитьПоПунктуНазначения Тогда
			МенеджерЗаписи.ПунктНазначения = Строка.ПунктНазначения;
		КонецЕсли;
		МенеджерЗаписи.Количество = Строка.КоличествоДней;
		Попытка
			МенеджерЗаписи.Записать();	
		Исключение
			Если Не ПараметрыЗаписи.ГрузитьПоПунктуНазначения Тогда
				Отбор = Новый Структура(КолонкиДляГруппировкиПоКонтрагенту);
				ЗаполнитьЗначенияСвойств(Отбор, Строка);
				НайденныеСтрокиСОшибками = ТаблицаДанныхДляЗаписи.НайтиСтроки(Отбор);
				
				Для Каждого Строка Из НайденныеСтрокиСОшибками Цикл
					СтрокаСОшибкой = Новый Структура();
					ЗаполнитьЗначенияСвойств(СтрокаСОшибкой, Строка);										
					СтрокиСОшибками.Добавить(СтрокаСОшибкой);
	            КонецЦикла;
			Иначе
				СтрокаСОшибкой = Новый Структура();
				СтрокаСОшибкой.Вставить("Контрагент");
				СтрокаСОшибкой.Вставить("ИНН");
				СтрокаСОшибкой.Вставить("ТТКПП");
				СтрокаСОшибкой.Вставить("КодТТSY");
				СтрокаСОшибкой.Вставить("КоличествоДней");
				
				ЗаполнитьЗначенияСвойств(СтрокаСОшибкой, Строка);
				СтрокиСОшибками.Добавить(СтрокаСОшибкой);	
			КонецЕсли;
			
			РезультатЗагрузки.ЕстьОшибки = Истина;
		КонецПопытки;
	КонецЦикла;	
		
	Если РезультатЗагрузки.ЕстьОшибки Тогда
		РезультатЗагрузки.СтрокиСОшибкамиЗагрузки = СтрокиСОшибками;
	КонецЕсли;		
		
КонецПроцедуры

#КонецОбласти
